       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. PYRAMIDOFAHRAXIS.

DATA DIVISION.
       WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
       DISPLAY "PYRAMID OF AHRAXIS"
STOP RUN.
